app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES('', '', '', '2010-02-11 10:37:43', '2010-02-11 10:37:43')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

SELECT * FROM "users" WHERE ("users"."username" IS NULL) LIMIT 1
---
  def check_existed
    u = User.find_by_username(params[:username]);